package org.RPS.game.gameoptions;

import org.RPS.player.Player;

import java.util.List;

public interface PlayersOptions {
    List<Player> getPlayers();
}

//Порождающие паттерны - паттерны для создания объектов и классов
//Абстрактная фабрика, Фабричный метод, Строитель (builder),
//Прототип (Prototype), Одиночка (Singleton)

//Структурные паттерны
//Адаптер, Мост, Компановщик, Декаратор, Фасад,
//Приспособленец, Заместитель

//Поведенческие паттерны
//Цепочка обязаностей, Команда, Интерпритатр, Итератор,
//Посредник, Хранитель, Наблюдатель, Состояние, Стратегия,
//Шаблонный метод, Посететель